config.org
#+title: Configuration
#+startup: overview
#+property: header-args :tangle yes :results silent

* General

#+begin_src elisp

(setq user-full-name "Zulfiqar Soomro"
      user-mail-address "me@zusoomro.com")

(setq doom-font (font-spec :family "Fira Code" :size 13)
      doom-variable-pitch-font (font-spec :family "Charter" :size 16))

(setq doom-theme 'doom-one-light)

(setq display-line-numbers-type nil)

;; here are some additional functions/macros that could help you configure doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; to get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'k' (non-evil users must press 'c-c c k').
;; this will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
#+end_src

#+begin_src emacs-lisp
(add-hook! nov-mode
  (setq visual-fill-column-mode t)
  (setq visual-fill-column-center-text t)
  (setq line-spacing 4))

(add-hook! writeroom-mode (doom/reset-font-size))

(after! fill-column (setq visual-fill-column-center-text t))



;; (setq evil-vsplit-window-right t
;;       evil-split-window-below t)

(setq delete-by-moving-to-trash t)
#+end_src

** Visual

#+begin_src elisp
(setq visual-fill-column-center-text t)
(setq-default line-spacing 4)
#+end_src

** Editing

#+begin_src elisp
(setq kill-whole-line t)

(after! org
  (map! :map org-mode-map :g "C-'" 'nil)
  (map! :g "C-'" 'avy-goto-char)
  )

(avy-setup-default)
#+end_src

Don't let swiper use line-move in =visual-line-mode= files to keep it fast.

#+begin_src elisp
(setq swiper-use-visual-line-p #'ignore)
#+end_src

Also, bind =C-s= to =swiper-isearch=, and =C-r= to =swiper-isearch-backward=

#+begin_src elisp

(map! :g "C-s" #'swiper-isearch)
(map! :g "C-r" #'swiper-isearch-backward)
#+end_src

#+begin_src elisp
(setq mac-right-option-modifier 'meta)
(setq mac-command-modifier 'super)
(setq mac-right-command-modifier 'left)
#+end_src

* Productivity
** Org
*** Set locations for org packages
Point all packages to the correct location.
#+begin_src elisp
;; if you use `org' and don't want your org files in the default location below,
;; change `org-directory'. it must be set before org loads!

(setq root-directory "~/Dropbox")
(setq gtd-directory (concat root-directory "/gtd"))
(setq notes-directory (concat root-directory "/notes"))
(setq journal-directory (concat root-directory "/journal"))

(setq org-directory notes-directory)
(setq org-roam-directory notes-directory)
(setq org-agenda-files `("~/Dropbox/gtd"))
(setq org-journal-dir journal-directory)
(setq org-archive-location (concat gtd-directory "/archive.org_archive::datetree/"))
#+end_src
*** Appearance
#+begin_src elisp
(add-hook! org-mode (visual-fill-column-mode))
(setq org-startup-folded t)
(setq org-hide-emphasis-markers t)
;; (setq mixed-pitch-set-height t)
;; (add-hook! org-mode (mixed-pitch-mode))
#+end_src
*** org-pomodoro
#+begin_src elisp
(setq org-pomodoro-keep-killed-time t)
(setq org-pomodoro-keep-killed-pomodoro-time t)
#+end_src
*** org-noter
#+begin_src elisp
;; (after! (pdf-tools org-noter)
;;   (map! :map pdf-view-mode-map
;;         :n "i" #'org-noter-insert-note))
#+end_src
*** org-agenda
#+begin_src elisp
(setq org-agenda-dim-blocked-tasks nil)
(setq org-agenda-custom-commands
      '(("c" "cis380" tags-todo "cis380")
        ("C" "cis400" tags-todo "cis400")
        ("u" "urbs420" tags-todo "urbs420")
        ("e" "econ045" tags-todo "econ045")
        ("l" "lgst206" tags-todo "lgst206")
        ("i" "inbox" tags-todo "inbox")
        ("p" "projects" tags-todo "projects")
        ("h" "habits" tags-todo "STYlE=\"habit\"")
        ("n" "next-actions" todo "NEXT")
        ("r" "routines" search "Routine")
        ("o" "Daily Agenda"
         ((agenda "" (
                      (org-agenda-span 1)
                      (org-agenda-overriding-header "Agenda")
                      (org-agenda-start-day ".")
                      ))
          (todo "NEXT" ((org-agenda-overriding-header "Next actions")))
          (todo "WAIT" ((org-agenda-overriding-header "Waiting")))
          ;; (tags-todo "STYlE=\"habit\"" ((org-agenda-overriding-header "Habits")))
          )
         (
          (org-habit-show-habits nil))
         )
        ))
(setq org-stuck-projects '("+LEVEL=2/-DONE/-SMDY/-TAG" ("NEXT" "NEXTACTION") ("someday" "agenda") ""))
#+end_src
*** org-super-agenda

Followed these configs to set up agenda:
https://tecosaur.github.io/emacs-config/config.html
https://www.baty.net/2019/org-super-agenda/

Leave it out for now, can't get it to work with evil keybindings
#+begin_src elisp :tangle no
(use-package! org-super-agenda
  :commands (org-super-agenda-mode))
(after! org-agenda
  (org-super-agenda-mode))

;; (setq org-agenda-skip-scheduled-if-done t
;;       org-agenda-skip-deadline-if-done t
;;       org-agenda-include-deadlines t
;;       org-agenda-block-separator nil
;;       org-agenda-tags-column 100 ;; from testing this seems to be a good value
;;       org-agenda-compact-blocks t)

(map! :map org-super-agenda-header-map
      "j" #'org-agenda-next-line
      "k" #'org-agenda-previous-line
      :map org-agenda-keymap
      "k" #'org-agenda-previous-line
      "j" #'org-agenda-next-line)

;; (add-hook 'org-agenda-mode-map #'evil-normalize-keymaps)

(add-to-list 'org-agenda-custom-commands
             '("O" "Overview"
               ((agenda "" ((org-agenda-span 'day)
                            (org-super-agenda-groups
                             '((:name "Today"
                                :time-grid t
                                :date today
                                :todo "TODAY"
                                :scheduled today
                                :order 1)))))
                (alltodo "" ((org-agenda-overriding-header "")
                             (org-super-agenda-groups
                              '((:name "Next to do"
                                 :todo "STRT"
                                 :order 1)
                                (:name "Important"
                                 :tag "Important"
                                 :priority "A"
                                 :order 6)
                                (:name "Due Today"
                                 :deadline today
                                 :order 2)
                                (:name "Due Soon"
                                 :deadline future
                                 :order 8)
                                (:name "Overdue"
                                 :deadline past
                                 :face error
                                 :order 7)
                                (:name "Habits"
                                 :habit t
                                 :scheduled today
                                 :order 8)
                                (:discard (:tag ("Chore" "Routine" "Daily"))))))))))
#+end_src

*** Tags
#+begin_src elisp
(setq org-tag-persistent-alist '(
                                 (:startgroup . nil)
                                 ("cis380" . ?c)
                                 ("cis400" . ?C)
                                 ("urbs420" . ?u)
                                 ("econ045" . ?e)
                                 ("lgst206" . ?l)
                                 (:newline . nil)
                                 ("work" . ?w)
                                 ("personal" . ?p)
                                 ("school" . ?s)
                                 ("social" . ?S)
                                 ("TA" . ?t)
                                 ("vehicle" . ?v)
                                 ))

(map! [remap org-set-tags-command] nil)
#+end_src
*** Capture
#+begin_src elisp
(after! org (setq org-capture-templates
                  `(("i" "Inbox" entry (file "~/Dropbox/gtd/inbox.org")
                     ,(concat "* TODO %?\n"
                              "/Entered on/ %U"))
                    ("I" "Inbox w/ attachment" entry (file "~/Dropbox/gtd/inbox.org")
                     ,(concat "* TODO %?\n"
                              "%a\n"
                              "/Entered on/ %U"))
                    )))
#+end_src
*** org-journal
#+begin_src elisp
(setq org-journal-file-format "%Y-%m-%d.org.gpg"
      org-journal-file-type 'weekly)
#+end_src
*** org-habit
#+begin_src elisp
(require 'org-checklist)
(after! org (add-to-list 'org-modules 'org-habit t)
  (add-to-list 'org-modules 'org-checklist t))
#+end_src
*** org-caldav
#+begin_src elisp
(after! org-caldav
  (setq
   org-caldav-url "https://caldav.fastmail.com/dav/calendars/user/me@zusoomro.com/"
   org-caldav-calendar-id "54b62cc0-e024-4081-a88a-14abdf81d875"
   org-caldav-inbox "~/Dropbox/gtd/calendar-two.org"
   org-caldav-backup-file "~/Dropbox/gtd/calendar.org.bak"
   ))
#+end_src
*** org-roam
#+begin_src elisp
(setq +org-roam-open-buffer-on-find-file nil)
#+end_src
*** org-export
#+begin_src elisp
(setq org-export-preserve-breaks t)
#+end_src
*** Todo keywords
#+begin_src elisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "PROJ(p)" "WAIT(w)" "|" "DONE(d)" "CNCL(c)" "SMDY(s)"))

      org-todo-keyword-faces
      '(("[-]" . +org-todo-active)
        ("NEXT" . +org-todo-active)
        ("[?]" . +org-todo-onhold)
        ("WAIT" . +org-todo-onhold)
        ("HOLD" . +org-todo-onhold)
        ("SMDY" . +org-todo-onhold)
        ("PROJ" . +org-todo-project))
      )
#+end_src
