config.el
(setq user-full-name "Zulfiqar Soomro"
      user-mail-address "me@zusoomro.com")

(setq doom-font (font-spec :family "Fira Code" :size 13)
      doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 13))

(setq doom-theme 'doom-one-light)

(setq display-line-numbers-type nil)

;; here are some additional functions/macros that could help you configure doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; to get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'k' (non-evil users must press 'c-c c k').
;; this will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

(setq visual-fill-column-center-text t)
(setq-default line-spacing 4)

(setq kill-whole-line t)

(after! org
  (map! :map org-mode-map :g "C-'" 'nil)
  (map! :g "C-'" 'avy-goto-char)
  )
(avy-setup-default)

(setq swiper-use-visual-line-p #'ignore)

;;(map! :g "C-s" #'swiper-isearch)
;;(map! :g "C-r" #'swiper-isearch-backward)

;; if you use `org' and don't want your org files in the default location below,
;; change `org-directory'. it must be set before org loads!

(setq root-directory "~/Dropbox")
(setq gtd-directory (concat root-directory "/gtd"))
(setq notes-directory (concat root-directory "/notes"))
(setq journal-directory (concat root-directory "/journal"))

(setq org-directory notes-directory)
(setq org-roam-directory notes-directory)
(setq org-agenda-files `("~/Dropbox/gtd"))
(setq org-journal-dir journal-directory)
(setq org-archive-location (concat gtd-directory "/archive.org_archive::datetree/"))

(add-hook! org-mode (visual-fill-column-mode))
(setq org-startup-folded t)
(setq org-hide-emphasis-markers t)
;; (setq mixed-pitch-set-height t)
;; (add-hook! org-mode (mixed-pitch-mode))

(setq org-pomodoro-keep-killed-time t)
(setq org-pomodoro-keep-killed-pomodoro-time t)

;; (after! (pdf-tools org-noter)
;;   (map! :map pdf-view-mode-map
;;         :n "i" #'org-noter-insert-note))

(setq org-agenda-dim-blocked-tasks nil)
(setq org-agenda-custom-commands
      '(("c" "cis380" tags-todo "cis380")
        ("C" "cis400" tags-todo "cis400")
        ("u" "urbs420" tags-todo "urbs420")
        ("e" "econ045" tags-todo "econ045")
        ("l" "lgst206" tags-todo "lgst206")
        ("i" "inbox" tags-todo "inbox")
        ("p" "projects" tags-todo "projects")
        ("h" "habits" tags-todo "STYlE=\"habit\"")
        ("n" "next-actions" todo "STRT")
        ("r" "routines" search "Routine")
        ("o" "Daily Agenda"
         ((agenda "" (
                      (org-agenda-span 1)
                      (org-agenda-overriding-header "Agenda")
                      (org-agenda-start-day ".")
                      ))
          (todo "STRT" ((org-agenda-overriding-header "Next actions"))))
         ((org-agenda-block-separator nil)
          (org-habit-show-habits nil))
         )
        ))

(setq org-tag-persistent-alist '(
                                 (:startgroup . nil)
                                 ("cis380" . ?c)
                                 ("cis400" . ?C)
                                 ("urbs420" . ?u)
                                 ("econ045" . ?e)
                                 ("lgst206" . ?l)
                                 (:newline . nil)
                                 ("work" . ?w)
                                 ("personal" . ?p)
                                 ("school" . ?s)
                                 ("social" . ?S)
                                 ("TA" . ?t)
                                 ("vehicle" . ?v)
                                 ))

(map! [remap org-set-tags-command] nil)

(after! org (setq org-capture-templates
                  `(("i" "Inbox" entry (file "~/Dropbox/gtd/inbox.org")
                     ,(concat "* TODO %?\n"
                              "/Entered on/ %U"))
                    ("I" "Inbox w/ attachment" entry (file "~/Dropbox/gtd/inbox.org")
                     ,(concat "* TODO %?\n"
                              "%a\n"
                              "/Entered on/ %U"))
                    )))

(setq org-journal-file-format "%Y-%m-%d.org")

(require 'org-checklist)
(after! org (add-to-list 'org-modules 'org-habit t)
  (add-to-list 'org-modules 'org-checklist t))

(after! org-caldav
  (setq
   org-caldav-url "https://caldav.fastmail.com/dav/calendars/user/me@zusoomro.com/"
   org-caldav-calendar-id "54b62cc0-e024-4081-a88a-14abdf81d875"
   org-caldav-inbox "~/Dropbox/gtd/calendar-two.org"
   org-caldav-backup-file "~/Dropbox/gtd/calendar.org.bak"
   ))

(setq +org-roam-open-buffer-on-find-file nil)

(setq org-export-preserve-breaks t)

(after! mu4e
