config.el
  ;; Each path is relative to `+mu4e-mu4e-mail-path', which is ~/.mail by default
  (setq mu4e-view-prefer-html t)
  (setq fill-flowed-encode-column 998)
  (setq mu4e-maildir-shortcuts '(
                                 (:maildir "/me/Spam" :key ?S)
                                 (:maildir "/seas/[Gmail]/Spam" :key ?s)
                                 (:maildir "/me/INBOX" :key ?I)
                                 (:maildir "/seas/INBOX" :key ?i)))
  (setq +mu4e-mu4e-mail-path "~/.mail")

  (set-email-account! "me"
                      '((mu4e-sent-folder       . "/me/Sent")
                        (mu4e-drafts-folder     . "/me/Drafts")
                        (mu4e-trash-folder      . "/me/Trash")
                        (mu4e-refile-folder     . "/me/Archive")
                        (smtpmail-smtp-user     . "me@zusoomro.com")
                        (user-mail-address      . "me@zusoomro.com")
                        (smtpmail-default-smtp-server . "smtp.fastmail.com")
                        (smtpmail-smtp-server         . "smtp.fastmail.com")
                        (smtpmail-stream-type . starttls)
                        (smtpmail-smtp-service . 587))
                      t)

  (set-email-account! "gmail"
                      '((mu4e-sent-folder       . "/gmail/[Gmail]/Sent Mail")
                        (mu4e-drafts-folder     . "/gmail/[Gmail]/Drafts")
                        (mu4e-trash-folder      . "/gmail/[Gmail]/Trash")
                        (mu4e-refile-folder     . "/gmail/[Gmail]/All Mail")
                        (smtpmail-smtp-user     . "zulfiqar0821@gmail.com")
                        (user-mail-address      . "zulfiqar0821@gmail.com")
                        (smtpmail-default-smtp-server . "smtp.gmail.com")
                        (smtpmail-smtp-server         . "smtp.gmail.com")
                        (smtpmail-smtp-server         . "smtp.gmail.com")
                        (smtpmail-stream-type . ssl)
                        (smtpmail-smtp-service . 465))
                      t)

  (set-email-account! "seas"
                      '((mu4e-sent-folder       . "/seas/[Gmail]/Sent Mail")
                        (mu4e-drafts-folder     . "/seas/[Gmail]/Drafts")
                        (mu4e-trash-folder      . "/seas/[Gmail]/Trash")
                        (mu4e-refile-folder     . "/seas/[Gmail]/All Mail")
                        (smtpmail-smtp-user     . "zusoomro@seas.upenn.edu")
                        (user-mail-address      . "zusoomro@seas.upenn.edu")
                        (smtpmail-default-smtp-server . "smtp.gmail.com")
                        (smtpmail-smtp-server         . "smtp.gmail.com")
                        (smtpmail-smtp-server         . "smtp.gmail.com")
                        (smtpmail-stream-type . ssl)
                        (smtpmail-smtp-service . 465))
                      t)
  (setq
   message-send-mail-function   'smtpmail-send-it
   send-mail-function   'smtpmail-send-it
   smtpmail-default-smtp-server "smtp.fastmail.com"
   smtpmail-smtp-server         "smtp.fastmail.com"
   smtpmail-stream-type 'starttls
   smtpmail-smtp-service 587)

  (add-to-list 'mu4e-bookmarks '("maildir:\"/me/INBOX\" OR  maildir:\"/seas/INBOX\" OR  maildir:\"/gmail/INBOX\"" "Inboxes" ?i))
  )

;; (add-hook! mu4e-view-mode
;;   (visual-fill-column-mode)
;;   (auto-fill-mode -1)
;;   )
(setq-hook! 'mu4e-view-mode visual-fill-column-center-text nil)

(map! :map mu4e-headers-mode-map :n "/" `evil-ex-search-forward)

;; config.el
(use-package slack
  :commands slack-start
  :init
  (setq slack-buffer-emojify t) ;; if you want to enable emoji, default nil
  (setq slack-prefer-current-team t)
  :config
  (slack-register-team
   :name "Senior Design"
   :token (auth-source-pick-first-password
           :host "seniordesign-hma6210.slack.com"
           :user "me@zusoomro.com")
   :subscribed-channels '((general random)))

  (slack-register-team
   :name "CIS557"
   :token (auth-source-pick-first-password
           :host "cis-557.slack.com"
           :user "zusoomro@seas.upenn.edu")
   :subscribed-channels '((general random)))

  ;; (map! (:map slack-info-mode-map
  ;;        "u" #'slack-room-update-messages)
  ;;       (:map slack-mode-map
  ;;        "C-n" 'slack-buffer-goto-next-message
  ;;        "C-p" 'slack-buffer-goto-prev-message)
  ;;       (:localleader
  ;;        (:map slack-mode-map
  ;;         "c" 'slack-buffer-kill
  ;;         "ra" 'slack-message-add-reaction
  ;;         "rr" 'slack-message-remove-reaction
  ;;         "rs" 'slack-message-show-reaction-users
  ;;         "pl" 'slack-room-pins-list
  ;;         "pa" 'slack-message-pins-add
  ;;         "pr" 'slack-message-pins-remove
  ;;         "mm" 'slack-message-write-another-buffer
  ;;         "me" 'slack-message-editp
  ;;         "md" 'slack-message-delete
  ;;         "u" 'slack-room-update-messages
  ;;         "2" 'slack-message-embed-mention
  ;;         "3" 'slack-message-embed-channel)
  ;;        (:map slack-edit-message-mode-map
  ;;         "k" 'slack-message-cancel-edit
  ;;         "s" 'slack-message-send-from-buffer
  ;;         "2" 'slack-message-embed-mention
  ;;         "3" 'slack-message-embed-channel))))
  )
(use-package alert
  :commands alert
  :init (setq alert-default-style 'notifier))

(map! :map dired-mode-map :g "-" `dired-up-directory)

(after! java-mode (setq c-basic-offset 4))
(setq js-indent-level 2)
(setq typescript-indent-level 2)
(setq web-mode-code-indent-offset 2
      web-mode-markup-indent-offset 2)
(after! lsp-mode (setq +format-with-lsp nil))
(setq +format-with-lsp nil)
(setq-hook! 'typescript-tsx-mode +format-with-lsp nil)
(setq-hook! 'typescript-mode +format-with-lsp nil)
(setq +default-want-RET-continue-comments nil)

(defun zulfi/hello-world ()
  "My first elisp function!"
  (interactive)
  (message "Hello World!"))

(defun zulfi/magit-refresh-maybe ()
  (dolist (buf (doom-buffers-in-mode 'magit-status-mode))
    (with-current-buffer buf
      (magit-refresh-buffer))))
(run-with-idle-timer 3 t #'zulfi/magit-refresh-maybe)

(defun zulfi/senior-design-terminals ()
  "Opens the terminals for senior design"
  (interactive)
  ;; Open and set up the api terminal
  (call-interactively `doom/window-maximize-buffer)
  (call-interactively `+vterm/here)
  (end-of-buffer)
  (vterm-send-string "cd ~/code/wigo/api\n")
  (vterm-send-string "source .env\n")
  (vterm-send-string "yarn start\n")

  ;; Split and move terminals
  (call-interactively `split-window-right)

  ;; Set up the mobile terminal
  (call-interactively `+vterm/here)
  (end-of-buffer)
  (vterm-send-string "cd ~/code/wigo/mobile\n")
  (vterm-send-string "yarn start\n")

  ;; Save the window configuration and return
  (window-configuration-to-register ?a)
  (message "Done!")
  )
(map! :leader
      :desc "Open senior design terminals"  :g "o C"
      'zulfi/senior-design-terminals)
